In [1]:
import pandas as pd #It is import statement for pandas librarry and created pandas object as pd

In [3]:
df=pd.read_csv('/content/Absenteeism_data.csv') #It is statement to read csv dataset file and store to df1
df1=pd.DataFrame(df)
df1

     ID  Reason for Absence  ... Pets  Absenteeism Time in Hours
0    11                  26  ...    1                          4
1    36                   0  ...    0                          0
2     3                  23  ...    0                          2
3     7                   7  ...    0                          4
4    11                  23  ...    1                          2
..   ..                 ...  ...  ...                        ...
695  17                  10  ...    0                          8
696  28                   6  ...    2                          3
697  18                  10  ...    0                          8
698  25                  23  ...    0                          2
699  15                  28  ...    1                          2

[700 rows x 12 columns]

In [7]:
type(df1) # This is used to check type of dataset or DataFrame

pandas.core.frame.DataFrame

In [8]:
df1.info()#This method shows statistical information of dataset including Rows ,colunms, Index, Data type of each column
#count Not null and Memory usage.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 12 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   ID                         700 non-null    int64
 1   Reason for Absence         700 non-null    int64
 2   Date                       700 non-null    object
 3   Transportation Expense     700 non-null    int64
 4   Distance to Work           700 non-null    int64
 5   Age                        700 non-null    int64
 6   Daily Work Load Average    700 non-null    float64
 7   Body Mass Index            700 non-null    int64
 8   Education                  700 non-null    int64
 9   Children                   700 non-null    int64
 10  Pets                       700 non-null    int64
 11  Absenteeism Time in Hours  700 non-null    int64
dtypes: float64(1), int64(10), object(1)
memory usage: 65.8+ KB

In [15]:
df1=df1.drop('ID',axis=1) #It used to drop ID column from dataset
df1

     Reason for Absence        Date  ...  Pets  Absenteeism Time in Hours
0                    26  07/07/2015  ...     1                          4
1                     0  14/07/2015  ...     0                          0
2                    23  15/07/2015  ...     0                          2
3                     7  16/07/2015  ...     0                          4
4                    23  23/07/2015  ...     1                          2
..                  ...         ...  ...   ...                        ...
695                  10  23/05/2018  ...     0                          8
696                   6  23/05/2018  ...     2                          3
697                  10  24/05/2018  ...     0                          8
698                  23  24/05/2018  ...     0                          2
699                  28  31/05/2018  ...     1                          2

[700 rows x 11 columns]

In [16]:
df1.columns

Index(['Reason for Absence', 'Date', 'Transportation Expense',
       'Distance to Work', 'Age', 'Daily Work Load Average', 'Body Mass Index',
       'Education', 'Children', 'Pets', 'Absenteeism Time in Hours'],
      dtype='object')

In [17]:
df1=df1.drop('Age',axis=1) #It used to drop Age column from dataset
df1

     Reason for Absence        Date  ...  Pets  Absenteeism Time in Hours
0                    26  07/07/2015  ...     1                          4
1                     0  14/07/2015  ...     0                          0
2                    23  15/07/2015  ...     0                          2
3                     7  16/07/2015  ...     0                          4
4                    23  23/07/2015  ...     1                          2
..                  ...         ...  ...   ...                        ...
695                  10  23/05/2018  ...     0                          8
696                   6  23/05/2018  ...     2                          3
697                  10  24/05/2018  ...     0                          8
698                  23  24/05/2018  ...     0                          2
699                  28  31/05/2018  ...     1                          2

[700 rows x 10 columns]

In [18]:
df1.columns#It used to display coulumns  in  perticular Dataset

Index(['Reason for Absence', 'Date', 'Transportation Expense',
       'Distance to Work', 'Daily Work Load Average', 'Body Mass Index',
       'Education', 'Children', 'Pets', 'Absenteeism Time in Hours'],
      dtype='object')

In [19]:
df1['Reason for Absence'].max()#It used to display max values in  perticular column

28

In [20]:
df1['Reason for Absence'].min()#It used to display min values in  perticular column

0

In [22]:
len(df1['Reason for Absence']) #It used to display length or no. of values in  perticular column

700

In [23]:
df1.info() 
#This method shows statistical information of dataset including Rows ,colunms, Index, Data type of each column
#count Not null and Memory usage.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Reason for Absence         700 non-null    int64
 1   Date                       700 non-null    object
 2   Transportation Expense     700 non-null    int64
 3   Distance to Work           700 non-null    int64
 4   Daily Work Load Average    700 non-null    float64
 5   Body Mass Index            700 non-null    int64
 6   Education                  700 non-null    int64
 7   Children                   700 non-null    int64
 8   Pets                       700 non-null    int64
 9   Absenteeism Time in Hours  700 non-null    int64
dtypes: float64(1), int64(8), object(1)
memory usage: 54.8+ KB